Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine.Type Property
 The appearance of the line. For instance solid, dashed or dotted.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GraphicPolyLine.LineType Type { get; set; }
Public Property Type As GraphicPolyLine.LineType
	Get
	Set
Property Value
Type: GraphicPolyLine.LineType
See Also
Reference
GraphicPolyLine Class
Tekla.Structures.Model.UI Namespace